The  OrdinateDimensionSetting  type exposes the following members.
 Properties
Name  |   Description
DimensionLineLength
 dimension line length
DimensionLineStyle
 dimension line style
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
OriginTickMarkId
 dimension origin tick mark ID
OriginVisibility
 dimension ordinate origin visibility
TextOrientation
 dimension text orientation
TextPosition
 dimension text position
 See Also
  OrdinateDimensionSetting Class
  Autodesk.Revit.DB Namespace